# CannotCopyMustBeUniqueViewportWarn Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyMustBeUniqueViewportWarn Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Multiple instances of the same view in sheets not supported.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyMustBeUniqueViewportWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyMustBeUniqueViewportWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyMustBeUniqueViewportWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace